Revit 2024 API
StructuralSectionGeneralCEx Class
 Defines parameters for Channel With Fold Cold Formed shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class StructuralSectionGeneralCEx : StructuralSectionColdFormed
Visual Basic
Public Class StructuralSectionGeneralCEx _
	Inherits StructuralSectionColdFormed
Visual C++
public ref class StructuralSectionGeneralCEx : public StructuralSectionColdFormed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithFold
See Also
StructuralSectionGeneralCEx Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace